{
  "category": {
    "name": "T-Shirts & Tank Tops",
    "path": "t-shirts & tank tops",
    "title": "Men's T-shirts & Vests",
    "description": "Let’s talk staples with our edit of men’s T-shirts and vests. Find the perfect base for your ‘fit and browse ASOS DESIGN for fresh men’s white T-shirts and men’s black T-shirts. Or add a lil’ something extra to your look with a men’s vest in graphic prints. Love a logo? Filter by Nike for men’s designer T-shirts in regular and oversized fits (streetwear styling: nailed), or embrace those varsity vibes with its range of basketball vests. And if that’s not enough, browse The North Face for men’s tops with some *serious* throw-on, go-out appeal. We feel a closet refresh coming..."
  },
  "products": [
    {
      "images": [
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-1-black",
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-2",
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-3",
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-4",
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-4?$n_640w$&",
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-1-black?$n_640w$&",
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-2?$n_640w$&",
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-3?$n_640w$&",
        "https://images.asos-media.com/products/nike-club-unisex-t-shirt-in-black/201311263-4?$n_640w$&"
      ],
      "name": "Nike Club unisex T-shirt in black",
      "price": "Now $21.00",
      "oldPrice": "Now $21.00. Was $30.00. (-30%)",
      "description": {
        "color": ["Black"],
        "size": [
          "Please select",
          "XS",
          "S",
          "M",
          "L",
          "XL",
          "2XL",
          "3XL",
          "4XL"
        ],
        "details": [
          "Next stop: checkout",
          "Crew neck",
          "Short sleeves",
          "Nike logo embroidery to chest",
          "Regular fit"
        ]
      },
      "reviews": [
        [
          { "stars": 5, "count": 24 },
          { "stars": 4, "count": 17 },
          { "stars": 3, "count": 6 },
          { "stars": 2, "count": 6 },
          { "stars": 1, "count": 13 }
        ]
      ],
      "comments": [
        {
          "date": "1 month ago",
          "title": "GREAT FEEL",
          "content": "This has a nice solid feel, yet it is lightweight. The color is exactly as shown. Super quick delivery too!",
          "starRating": 5
        },
        {
          "date": "1 month ago",
          "title": "",
          "content": "This shirt is amazing until you wash it. It shrinks even when you hang dry it.",
          "starRating": 2
        },
        {
          "date": "2 months ago",
          "title": "GREAT TSHIRT",
          "content": "Grest tshirt. Comfortable tshirt. Have about 10 different colors of this shirt. The color is a little different than what I thought. Still will wear it, but just different from what i thought based on the picture and color name. Hate the tag.\nRead More",
          "starRating": 4
        },
        {
          "date": "2 months ago",
          "title": "GET READY TO BE DISAPPOINTED",
          "content": "Get ready to be disappointed!! Paper thin,Loose collar and all around cheap! Bought 3 and returned all 3... The picture of the neck with the collar is not accurate and way off.\nRead More",
          "starRating": 1
        },
        {
          "date": "2 months ago",
          "title": "",
          "content": "Great quality, and great for every day wear. 100% would recommend",
          "starRating": 5
        },
        {
          "date": "2 months ago",
          "title": "REDUCED QUALITY",
          "content": "Ok quality, but not the quality that they used to be pre 2018.",
          "starRating": 3
        },
        {
          "date": "6 months ago",
          "title": "NICE LOOK, POOR QUALITY",
          "content": "Looks great but it has gotten hole after the first wash.",
          "starRating": 2
        },
        {
          "date": "6 months ago",
          "title": "ROYAL BULE",
          "content": "I like the color of it and the way it fits my upper body. I bought a cotton type of shirt to try to get a different feel from the dry fit version. Also, it fits true to size (XL) in this version but other XL fits in dry fit, fits like an XXL...\nRead More",
          "starRating": 4
        },
        {
          "date": "7 months ago",
          "title": "COLLAR IS NOT FITTED AND VERY LOOSE, DISAPPOINTING.",
          "content": "Collar is horribly done. It’s droopy and looks super loose. No matter what you do you can’t fix it. I tried everything but in the end I had to take it to a tailor. Very disappointing.\nRead More",
          "starRating": 1
        },
        {
          "date": "8 months ago",
          "title": "BEWARE!! MAJOR SHRINKAGE!!",
          "content": "I wish that I had read the reviews because the length of this shirt shrinks drastically! I didn't think a regular tee with high reviews necessitated reading through reviews. Lesson learned! Hopefully I can return it. Super disappointing, Nike.\nRead More",
          "starRating": 1
        },
        {
          "date": "8 months ago",
          "title": "ADD TALL TO ORDER BECAUSE LENGTH OF SHIRT DOES SHRINK",
          "content": "The length of the shirt does shrink, I would definitely order normal size but add tall to order.",
          "starRating": 5
        },
        {
          "date": "8 months ago",
          "title": "",
          "content": "Simple and Comfortable. Perfect for everyday wear. Stretchy.",
          "starRating": 5
        },
        {
          "date": "8 months ago",
          "title": "NICE T-SHIRT",
          "content": "Nice t-shirt, but the collar is not that good. It seems to droop and not that stable.",
          "starRating": 4
        },
        {
          "date": "8 months ago",
          "title": "POOR QUALITY- SHRUNK",
          "content": "Poor quality- totally shrunk. Quality of fabric is terrible. Shrunk so bad, it’s too small to wear now.",
          "starRating": 2
        },
        {
          "date": "8 months ago",
          "title": "ORDER A SIZE UP",
          "content": "The fabric is nice but it will shrink even if you wash it with cold water and dry on low heat. Order a size up from what you normally wear otherwise it’s going to feel like a baby tee or crop top after you wash it.\nRead More",
          "starRating": 2
        },
        {
          "date": "9 months ago",
          "title": "FITS AMAZING",
          "content": "Great shirt, color is on point. I bought in a Medium and it’s just right. Can’t wait to wear it to gatherings",
          "starRating": 5
        },
        {
          "date": "9 months ago",
          "title": "DEFECTIVE SHIRT",
          "content": "I always wash my purchases before I wear them , after washing this shirt I noticed very small holes down the left side . I’ve never experienced this before and I’m very disappointed\nRead More",
          "starRating": 1
        },
        {
          "date": "10 months ago",
          "title": "GOOD QUALITY",
          "content": "Love the quality. Super comfortable for the Summer days. Love the colors that are available.",
          "starRating": 5
        },
        {
          "date": "10 months ago",
          "title": "RANDOM SIZING",
          "content": "Nice T-shirts but the sizing is so random. You can buy 2 no. Large T-shirts and they are totally different in size. I have a mix of size L and M because of this. Nike need to sort this as is very annoying.\nRead More",
          "starRating": 4
        },
        {
          "date": "10 months ago",
          "title": "NICE BASIC SHIRT",
          "content": "The shirt is nice and good to go on casually, as well as gym. it was just a bit loose and baggy looking, it does not fit tight",
          "starRating": 4
        },
        {
          "date": "11 months ago",
          "title": "TIMELESS CLASSIC",
          "content": "A t-shirt that knows exactly what it’s trying to be. Clean and simple. The soft cotton and embroidered logo will last many washes. This shirt is perfect for casual wear.",
          "starRating": 5
        },
        {
          "date": "1 year ago",
          "title": "GOOD FIT",
          "content": "Good fit. Purchased a medium because long sleeves fit right but for a looser fit go with a large. I’m 6ft 180 lbs",
          "starRating": 5
        },
        {
          "date": "1 year ago",
          "title": "DECREASE IN QUALITY.",
          "content": "Would not recommend. In my last order all swoosh logos began to unravel and make it unwearable.",
          "starRating": 1
        },
        {
          "date": "1 year ago",
          "title": "WHAT EVER HAPPENED TO FIDELITY?",
          "content": "It’s not a fit that you can count on. That’s for sure. Highly variable. Each one fits different. I’ve bought like 15 and it’s really hit or miss, especially with the neck line. Sometimes it’s wide open like a scoop neck made of bacon, other times it’s nice and snug around the collar like it should fit. Only way to find one that fit right is to try on a few (many?). The gorge green seems to always have a loose neck. I’ve tried multiple, so Nike might want to review the standard with whatever factory is making that color. The spruce green was perfect right out of the bag, first one I tried. Trust me; that’s super rare. If they could all fit this good, it’d be the perfect tee. Nike will probs not like my saying so, but I’d definitely order a few in the same size and color cause they won’t fit the same and the only way to find your fit is to try (a bunch of) them on.\nRead More",
          "starRating": 3
        },
        {
          "date": "1 year ago",
          "title": "SHRINK",
          "content": "Both shirts shrunk from an XL to a tight large. Would recommend shopping for something else.",
          "starRating": 1
        },
        {
          "date": "1 year ago",
          "title": "SOMETHING WENT WRONG",
          "content": "Order #C00939198939 Ordered two of these shirts. One fits fine and the second is small on one side. From middle of neck to the bottom of the sleeve on the right side was tight and easily a full or two sizes smaller. The black one I ordered is fine the grey one something went wrong and unwearable.\nRead More",
          "starRating": 1
        },
        {
          "date": "2 years ago",
          "title": "",
          "content": "I like it wish you let me order other colors but you won't",
          "starRating": 5
        },
        {
          "date": "2 years ago",
          "title": "TOO TIGHT",
          "content": "The t shirt is fine and looks good. However the description of it is it’s a standard fit. However when the t shirt arrived it is quite clearly a fitted t shirt. T shirts are quite strange with Nike , I have some that are medium and large that fit me, however this large t shirt was too tight.\nRead More",
          "starRating": 3
        },
        {
          "date": "2 years ago",
          "title": "YOU’VE HAD TOO MANY YEARS TO NOT BE ABLE TO MAKE A PROPER SHIRT",
          "content": "terrible shirt. i got a XXL and loved the original fit but after ONE wash it now fits like a vintage large and i got almost a crop top. i wanted more of them but i need a shirt that doesn’t lose its fit after one washing like cmon\nRead More",
          "starRating": 1
        },
        {
          "date": "2 years ago",
          "title": "NICE MATERIAL",
          "content": "I bought this as a Christmas gift for my mom since she really likes this color. Beautiful color, purchased a size Large looks pretty big hopefully she likes the fit",
          "starRating": 5
        },
        {
          "date": "2 years ago",
          "title": "",
          "content": "Love the shirt. Would be nice to win the Travis Scott shoes that will be releasing next month. Hint hint lol jk",
          "starRating": 5
        },
        {
          "date": "2 years ago",
          "title": "GOOD QUALITY GREAT COLOR BUT DIDN'T FIT RIGHT.",
          "content": "Wasn't true to fit.. I have 8 nike t shirts and the shirt didn't fit like the others.",
          "starRating": 1
        },
        {
          "date": "2 years ago",
          "title": "GREAT BASIC TEE, NOW IN TALL SIZES",
          "content": "Nice basic shirt in a color great for fall. The addition of tall sizes is huge.",
          "starRating": 5
        },
        {
          "date": "2 years ago",
          "title": "NOT GREAT FOR BIG GUYS",
          "content": "I am 6ft and am a big guy, bought 4xl, my shirt was structured weirdly and did not feel comfortable. Had wife look at my shirt while on and noticed the shirt was not fitted properly. Could just be me but it was also short so if you put your arms to your shoulder then your stomach will most likely show if you are a big guy.\nRead More",
          "starRating": 2
        },
        {
          "date": "2 years ago",
          "title": "COLOR IS OFF, BUT A FINE SHIRT NONETHELESS.",
          "content": "The shirt is a pretty good shirt, HOWEVER the Light sienna/White color option is NOT what it appears to be in the picture. The shirt is actually more orange than red. I don’t know if the shirt in the picture is even the same shirt as the one I got. Nike, if you read this, please take more accurate photos of your products. I ordered a size medium, and when I first got it, it looked a little big. After washing and machine drying according to manufacturer instructions, it fits much better. Can’t make any comments on durability yet because I’ve only had it about a week. Anyways, besides the color being way off it’s a fine shirt.\nRead More",
          "starRating": 3
        },
        {
          "date": "2 years ago",
          "title": "GREAT SHIRT.",
          "content": "Great product. I messed up my size. Should have ordered XL. My fault. Otherwise great shirt and great service. Thanks",
          "starRating": 5
        },
        {
          "date": "2 years ago",
          "title": "FOOLED",
          "content": "Shirt fits incredible new, after a few washes collar stretches and shrinks a ton. Better off buying a basic grey tee elsewhere.",
          "starRating": 2
        },
        {
          "date": "3 years ago",
          "title": "LOVE THIS PRODUCT! BRING BACK 3XLT AND 4XL",
          "content": "This shirt is amazing! I’m big body and once you start buying 3XLT shirts look like blankets. However, these shirts fit so good. I wish they would bring back the plus sizes ASAP. The fabric is nice and light.\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "BAD COLOR",
          "content": "the color in the picture does not resemble the actual color at all. I got the heather grey, in the picture it is very bright and vibrant, almost white. the shirt itself is a very dark heather grey. its so different I thought they sent me the wrong shirt initially. I understand the picture can't be totally accurate but its 100% completely different. these shirts fit well and are soft but are really thin. overall disappointing\nRead More",
          "starRating": 1
        },
        {
          "date": "3 years ago",
          "title": "AMAZING SHIRT, JUST A BIT JUICY",
          "content": "[This review was collected as part of a promotion.] When I opened the package, the first thing I noticed was how soft the fabric was. It was high quality cotton, fits nicely on the shoulders but around the waist it feels a bit juicy. That could be just my tall, thin frame though. It's great if you are looking for a relaxed comfortable fit to lounge around the house. I'm a bit of a sweater, and I noticed the sweat does dry pretty quickly without leaving a stain and it doesn't feel hot. Shirt itself is loose around the armpits which allows for large range of movement and reduces pit stains. Would recommend to others.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "NIKE SHIRT",
          "content": "[This review was collected as part of a promotion.] We received this Sportswear shirt in the mail the other day. Upon arrival, the sportswear shirt looks like a normal tee. The color is a beautiful navy blue with white lettering. My husband tried it, wearing it all day to work. He said it was very soft cotton, very comfortable. My observation was it definitely fit him well. It wasn't hanging off him or too tight. I would like to see how the color holds up, if it fades easily. Our only gripe about this shirt is it is slightly short. I watched my husband pull the bottom of the shirt down several times as if to make it longer. Other than that gripe, it was definitely a good shirt.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "IT’S A GOOD ALL PURPOSE SHIRT",
          "content": "[This review was collected as part of a promotion.] I got this shirt about a week ago and have already gone for a few runs, a hike, ski tour, and a few climbs in it. I’d say it’s super comfortable, stands up well to the sweat, and after a wash it seems good as new. It’s a very soft shirt, not weird feeling like a lot of performance shirts. The medium ran big for me (165 lbs at 5 10) and did not shrink. As a side note, my wife likes the shirt too and has nearly taken it over. Maybe buy two!\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "LIVES UP TO NIKE’S BRAND",
          "content": "[This review was collected as part of a promotion.] As someone who goes for morning runs semi-regularly, I was excited to add more athletic gear to my wardrobe. The first thing I noticed when opening the package was the stylish, yet unobtrusive Nike logo sewn on top of a gray shirt with enough texture to the gray to avoid looking like your grandparents’ workout clothes. The shirt is a lot softer than I was expecting after looking at the reasonable price tag as well. I am very pleased with the shirt for every day wear. The shirt does seem to be noticeably large, however. This wasn’t a problem when I wore it as a normal, every day shirt with my jeans and a jacket, but when I wore it on my run, it was very noticeable how large the shirt was on me. It is fine during the winter time when I’m bundled up anyway, but during the summer I’m going to want my clothes to be a lot lighter than this. And for that reason alone, I don’t think I’ll want to wear this shirt for my primary purpose of owning it: to run in it. But if you’re someone who wants to wear this simply as a normal shirt, I highly recommend this product. This is the high quality you would expect from a great brand.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "NOT YOUR GRANDPA’S T-SHIRT!",
          "content": "[This review was collected as part of a promotion.] I was pleasantly surprised upon receiving the Nike Sportswear Club T-Shirt. This is a very nice product featuring high quality cotton fabric that feels more like a tri-blend due to its buttery soft texture. I’m 5’10” with what I would regard as an athletic build, and the XL fit just as I hoped it would, hitting my comfortable below the waist. I would regard this T-Shirt as having more of a relaxed fit that is still fitted through the arms and chest without feeling too boxy. I like the small, embroidered Nike logo much more than some of the larger graphics I’ve seen. This makes it perfect for casual wear. I am also very pleased to have this arrive as a tagless T-Shirt. Overall, this is a product I will be purchasing in additional colors!\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "NICE EVERYDAY WEAR SHIRT",
          "content": "[This review was collected as part of a promotion.] I’m a huge fan of a sturdy, durable t-shirt, which is why I was so excited to receive the Nike Sportswear Club t-shirt. Overall, I am very happy with it. The weight of the shirt is nice and it makes it seem of good quality. I found the shirt to run a bit snug, so if you like a looser fit you may want to size up. The embroidered logo does not look quite as high-end as I expected, but it’s still a nice touch. The color of the shirt is a nice true navy.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "NIKE SPORTSWEAR CLUB T-SHIRT",
          "content": "[This review was collected as part of a promotion.] My husband loved the shirt when I gave it to him. My husband always been a big fan of Nike but we've never seen the stitched on Nike and that definitely made the shirt stand out. The shirt was super comfortable and well made.\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "COMFORTABLE AND BREATHABLE SHIRT",
          "content": "[This review was collected as part of a promotion.] I received the XL and had my husband wear it a few times and washed it in between wears. The fabric is breathable and the shirt fit like an average XL. My husband is a custodian and he said he would like more shirts like this for work. It kept him cool and moved with him. It washed really well and had no shrinkage. I did hang dry it though, so I can’t say how it would do in the dryer. Overall very happy with this shirt.\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "NICE SOFT AND COMFY SHIRT",
          "content": "[This review was collected as part of a promotion.] I got the navy blue colored Nike shirt in size large. My husband typically wears a large and it fit him perfectly. The shirt is a soft material, breathable, and comfortable. The only drawback is that it is slightly see through but that's not really a big deal.\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "COMFORTABLE",
          "content": "[This review was collected as part of a promotion.] I got the Nike shirt in the color navy and a size large. It is true to size and has a great fit. The fabric is soft, durable, breathable, and very comfortable to wear. It is casual but can be dressed up to play a round of golf. I like that the Nike emblem is embroidered vs printed and will not come off easily like previous shirts that I own. The shirt also washes and dries nicely.\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "GOOD WORKOUT SHIRT",
          "content": "[This review was collected as part of a promotion.] I usually like my clothes to fit slim and a medium size works for most brands. The medium I received of this shirt fit a little baggier than I am used to. With that said, however, the comfort of the shirt is nice. I have worked out in the shirt a couple times, and I felt it did not impede my movements at all.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "AMAZING NIKE SPORTSWEAR CLUB T-SHIRT",
          "content": "[This review was collected as part of a promotion.] I was shocked by how much I loved this Nike t-shirt. I'm not one to go for name brand t-shirts and never have been. However, this shirt may have changed my approach to buying t-shirts. As a 6'5 mid 30 year old it can very difficult to find shirts that fit my length without being overly baggy on the sides. Most XL shirts end up being too wide and hanging awkwardly down my torso. This t-shirt fit perfectly with some extra room to breathe without being too loose. This is one of the softest t-shirts I have worn and is incredibly comfortable. The fabric used is ultimately what makes me rethink how I will be purchasing t-shirts in the future. I was expecting to dislike the Nike logo on the t-shirt as I prefer solid t-shirts without any logo. However, the size of the logo felt appropriate and did not make me second guess where the t-shirt. Combined with the comfortableness of the fabric I didn't even notice the logo on the upper left breast. 100% I will buy more of these shirts and rethink how I purchase my clothing moving forward.\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "CLASSIC ATHLETIC T",
          "content": "[This review was collected as part of a promotion.] Comfortable, casual, and classic athletic t-shirt. Fits according to size. Material is soft and comfortable for everyday wear but also wicks sweat for exercise. Great price point for quality. Length of shirt was appropriate. The design is nothing fancy, but I appreciate that...don't need \"bling\" these days,..but I do appreciate comfort. Design and cut of the shirt is gender neutral.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "CASUAL YET CLASSY NIKE SHIRT",
          "content": "[This review was collected as part of a promotion.] This T-shirt has a casual feel but still looks classy. It definitely is making its way into the rotation to wear on the weekends. It is perfect for running errands, doing projects around the house and looks nice if we have any unexpected visitors stop by. The only thing I’d change is to have the fabric be softer. It by no means is rough and scratchy but it could be more soft and buttery. All in all this shirt is a casual but nice looking T-shirt that will be getting a lot of wear.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "IT’S A T-SHIRT",
          "content": "[This review was collected as part of a promotion.] It’s a t-shirt. It’s 100% cotton and average softness. It feels similar to any Nike shirt I’ve owned before. I have worn this shirt a few times while working. I’m a PE teacher and stay active. It holds up well. I wear an XL and the size fit me perfectly. There isn’t any moisture wicking aspects like I’m used to, but that’s ok! It does it’s job. If I had anything negative to say it would be there’s a slight irritation at the logo. It actually has a little scratchy texture to it that usually doesn’t bug me on other shirts. I had to iron on a small piece of cotton interfacing to keep it from irritating the skin even more, especially when sweating. I’d definitely choose another color. The sweat was very noticeable on my gray shirt. It is a nice shirt, nothing too much to brag about though.\nRead More",
          "starRating": 3
        },
        {
          "date": "3 years ago",
          "title": "GREAT SHIRT, LONG LENGTH",
          "content": "[This review was collected as part of a promotion.] The shirt was a great material. It’s breathable and contoured my body beautifully. Only reason why I gave it four stars is because it was long in length and I’m average in height. It hit below my hips.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "COMFY AND DURABLE",
          "content": "[This review was collected as part of a promotion.] This Nike XS shirt was well liked by our teen boy. He says it was really comfortable and the fabric was soft. He says he would wear it around the house or to workout in. He can tell the difference in quality and prefers this shirt over some of his other brand shirts. Only downside was after the first wash it looks like there are water-spots on it. That could be from something he did or the washer but it would have been nice if it would have come clean completely. Overall a good shirt and would like to own more!\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "I MAY HAVE FOUND MY NEW FAVORITE T",
          "content": "[This review was collected as part of a promotion.] I’ve noticed a huge change in how women’s clothes fit after having three kids, so most of my tops are from the men’s section. This shirt hit multiple points for me that I look for in my recent purchases: soft fabric/comfortable, good amount of length to wear either tucked or untucked, not too wide, semi-fitted sleeves, and wrinkle free. I typically wear a medium/large in women’s and a men’s small was perfect. After a full day of of wear, it still looked pristine and was without wrinkles. Loving the navy color and definitely want to check out what other colors are available in my size.\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "GREAT NIKE T-SHIRT",
          "content": "[This review was collected as part of a promotion.] I really liked the fabric on this shirt. Very breathable. The shirt is very comfortable for both working out or running errands. I tried a men's small and it fit me perfectly. My favorite feature is that the Nike logo is actually embroidered so it makes for a very nice high end T-shirt!\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "SUPER COMFORTABLE",
          "content": "[This review was collected as part of a promotion.] This shirt I very comfortable and the quality is really great. It washes well too, the color is still very vibrant and the fabric is durable. I will definitely wear this shirt regularly.\nRead More",
          "starRating": 5
        },
        {
          "date": "3 years ago",
          "title": "SEEMED SHORT BUT GOOD QUALITY",
          "content": "[This review was collected as part of a promotion.] The shirt was very comfortable to wear and was good quality cotton. I'm 6'1\" in height and tried a size Large. The shirt seemed a tad short in the front. However, that being said, it did feel nice on and was true to size. I would say if you are tall and would like the shirt to feel loose, order up a size. I could have probably worn an XL and it would have been perhaps longer for me. The shirt was stylish with a subtle Nike check mark in the corner. This makes it easy for me to wear this underneath another shirt. Overall great quality shirt.\nRead More",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "LOVE THE SHIRT BUT....",
          "content": "Over this shirt fits amazing, love the cotton feel, also feels like it will hold up for awhile, nice quality shirt, fits just perfectly, and the embroidered Nike logo is just a nice touch. The reason this is getting a 3 star is the I love the shirt and delivery time BUT upon opening the box the shirt was half way out of the plastic bag it was in and the bag was basically ripped open like it was a return, I paid full price at least you can send me a new shirt or let me know you’re sending a return shirt.\nRead More",
          "starRating": 3
        },
        {
          "date": "3 years ago",
          "title": "VERY BAD QUALITY",
          "content": "lost it color after 3-4 times in washer and at first i loved it now its not useable",
          "starRating": 1
        },
        {
          "date": "3 years ago",
          "title": "NOT TO MY LIKING",
          "content": "Disappointed in the fit and material, felt cheaper than others I’ve bought",
          "starRating": 1
        },
        {
          "date": "3 years ago",
          "title": "BLACK NIKE TEE",
          "content": "The shirt is very simple and goes with everything which I love! It’s a bit long though.",
          "starRating": 4
        },
        {
          "date": "3 years ago",
          "title": "DISAPPOINTED",
          "content": "Disappointed with the material. Low quality material.",
          "starRating": 1
        },
        {
          "date": "3 years ago",
          "title": "SUPER CLEAN T",
          "content": "This shirt is perfect. Good weight. Clean fit. I bought extras since they might not be around for long.",
          "starRating": 5
        }
      ]
    }
  ]
}
